Tirta7/voc_master_data_center/esp32s3uni_mqtt_client/esp32s3uni_mqtt_client.ino
/*
 * ESP32-S3 UNO MQTT Client — Panel Konvensional (Multi-Relay PCF8575)
 * VOC SYSTEM (Spot On Billiard)
 *
 * Arsitektur: 1 ESP32-S3 UNO per panel (mengontrol 1–16 relay via PCF8575)
 * Hardware  : PCF8575 (I2C GPIO Expander) → Relay Modul → Lampu 220V AC
 *
 * Topologi: WiFi MQTT langsung (tidak pakai ESP-NOW)
 * Gunakan firmware ini jika panel menggunakan ESP32-S3 UNO + PCF8575 + relay module.
 *
 * Fitur:
 *  1. Multi Modul PCF8575: Mendukung hingga puluhan modul (otomatis hitung
 * jumlah relay)
 *  2. Dynamic-Safe JSON: Alokasi memory JSON menyesuaikan jumlah relay
 *  3. Hardware Watchdog: Auto-restart jika sistem membeku (hang) >30s
 *  4. Anti-Ghost Switching: Verifikasi status I2C setiap 10 detik di semua
 * modul
 *  5. MQTT LWT (Last Will): Server tahu secara instan jika alat offline
 *  6. Extend Protection: Proteksi 60 detik saat tambah waktu (anti-race
 * condition)
 *  7. WiFi Stability: Auto-reconnect dengan full disconnect+begin cycle setiap
 * 30s
 *  8. MQTT Keep-Alive: 120s keep-alive + heartbeat 60s agar tidak drop saat
 * idle
 *  9. State Persistence: Status relay tersimpan ke SPIFFS, di-restore saat
 * power restore
 * 10. Identifikasi via MAC Address (otomatis, tanpa konfigurasi manual)
 * 11. STATUS LED (GPIO 16): Indikator status sistem tambahan
 * 12. RELAY CONTROL (GPIO 15): Output kontrol relay onboard
 *
 * PIN KONFIGURASI (ESP32-S3 UNO):
 *  MODE_SWITCH   : GPIO 46 (Saklar Mode Otomatis/Manual)
 *  LED_WIFI      : GPIO  3 (Indikator koneksi WiFi)
 *  STATUS_LED    : GPIO 16 (Indikator status sistem)
 *  TRANSISTOR_PIN: GPIO 14 (Master relay transistor)
 *  RELAY_CONTROL : GPIO 15 (Output kontrol relay)
 *  BUZZER        : GPIO 11 (Buzzer notifikasi)
 *  SDA_PIN       : GPIO  9 (I2C Data)
 *  SCL_PIN       : GPIO  8 (I2C Clock)
 *
 * TOPIK MQTT:
 *  Subscribe: billiard/table/{MAC}/#
 *  Publish  : billiard/table/{MAC}/status     (telemetry, retain=true)
 *           : billiard/table/{MAC}/heartbeat  (60s ping)
 *           : billiard/table/sync             (saat boot, minta state dari
 * server)
 */

#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <DNSServer.h> // 🛡️ Added for Portal
#include <PCF8575.h>
#include <Preferences.h> // 🛡️ Added for Persistent Settings
#include <PubSubClient.h>
#include <SPIFFS.h>
#include <WebServer.h> // 🛡️ Added for Portal
#include <WiFi.h>
#include <Wire.h>
#include <esp_mac.h>
#include <esp_system.h>
#include <esp_task_wdt.h>

// ─────────────────────────────────────────────────────────────
// PIN DEFINITIONS (ESP32-S3 UNO)
// ─────────────────────────────────────────────────────────────
#define MODE_SWITCH     46  // Saklar Mode Otomatis/Manual
#define LED_WIFI         3  // Indikator koneksi WiFi
#define STATUS_LED      16  // Indikator status sistem
#define TRANSISTOR_PIN  14  // Master relay transistor
#define RELAY_CONTROL   15  // Output kontrol relay
#define BUZZER          11  // Buzzer notifikasi
#define SDA_PIN          9  // I2C Data
#define SCL_PIN          8  // I2C Clock

// ─────────────────────────────────────────────────────────────
// CONFIGURATION STATE (Dinamis via Portal)
// ─────────────────────────────────────────────────────────────
char ssid[33]        = "";
char password[65]    = "";
char mqtt_server[65] = "";
int  mqtt_port       = 1883;

// GPIO Pins (default dari #define, bisa di-override via Portal)
int pin_mode_switch = MODE_SWITCH;
int pin_led_wifi    = LED_WIFI;
int pin_status_led  = STATUS_LED;
int pin_transistor  = TRANSISTOR_PIN;
int pin_relay_ctrl  = RELAY_CONTROL;
int pin_buzzer      = BUZZER;
int pin_sda         = SDA_PIN;
int pin_scl         = SCL_PIN;

// PCF Config
uint8_t pcfAddresses[8] = {0x20};
int num_pcf_modules = 1;
bool pcf_active_low = true; // Kembali ke Active Low (Standar Relay Optocoupler)

// Portal Objects
WebServer  server(80);
DNSServer  dnsServer;
Preferences preferences;
bool isConfigMode = false;
const byte DNS_PORT = 53;
PCF8575 *pcfModules[8]; // Mendukung hingga 8 modul (128 relay)
int num_relays = 16;

// ─────────────────────────────────────────────────────────────
// STATE & VARIABEL GLOBAL
// ─────────────────────────────────────────────────────────────
WiFiClient   espClient;
PubSubClient client(espClient);

String deviceMac = ""; // MAC Address tanpa pemisah, uppercase
String baseTopic = ""; // billiard/table/{deviceMac}

bool          relayState[128]          = {false};
bool          relayTarget[128]         = {false};
unsigned long relayProtectedUntil[128] = {0};
uint32_t      tableTimer[128]          = {0}; // 🛡️ Sisa waktu per meja (detik)
uint32_t      tableAlertTime[128]      = {0}; // 🛡️ Waktu alert per meja (detik)
uint8_t       relayBlinkCount[128]     = {0}; // Sisa transisi blink
unsigned long relayBlinkTimer[128]     = {0}; // Timer non-blocking blink
unsigned long lastTimerTick            = 0;

bool          storageDirty    = false;
unsigned long lastStateChange = 0;
const unsigned long STORAGE_SAVE_DELAY = 3000;

bool          modeOtomatis         = true;
bool          wasWifiConnected     = false;
int           buzzerBeepsRemaining = 0;
unsigned long buzzerNextToggle     = 0;
bool          buzzerState          = false;
unsigned long buzzerToneDuration   = 100;
unsigned long buzzerPauseDuration  = 100;
unsigned long lastMqttRetry        = 0;
unsigned long lastLedBlink         = 0;
unsigned long lastPcfVerify        = 0;
unsigned long lastStatusUpdate     = 0;
unsigned long lastHeartbeat        = 0;
unsigned long lastWifiCheck        = 0;
unsigned long portalTriggerStart   = 0; // 🛡️ Tracker untuk tombol BOOT

const unsigned long STATUS_INTERVAL    = 30000; // Telemetry tiap 30s
const unsigned long HEARTBEAT_INTERVAL = 60000; // Heartbeat tiap 60s
const unsigned long WIFI_FULL_RECONNECT =
    30000; // Full reconnect jika WiFi putus >30s

// ─────────────────────────────────────────────────────────────
// CONFIGURATION PERSISTENCE (NVM via Preferences)
// ─────────────────────────────────────────────────────────────

void loadSettings() {
  // --- BARIS TAMBAHAN UNTUK RESET ---
  preferences.begin("voc-config", false);
  preferences.remove("pAL"); // Paksa hapus memori Active Low lama
  preferences.end();
  // ----------------------------------

  preferences.begin("voc-config", true);

