Tirta7/voc_master_data_center/esp32s3uni_mqtt_client/esp32s3uni_mqtt_client.ino
  preferences.getString("ssid", "").toCharArray(ssid, 33);
  preferences.getString("pass", "").toCharArray(password, 65);
  preferences.getString("mqtt", "192.168.1.5").toCharArray(mqtt_server, 65);
  mqtt_port = preferences.getInt("port", 1883);

  pin_mode_switch = preferences.getInt("pMod", MODE_SWITCH);
  pin_led_wifi    = preferences.getInt("pLed", LED_WIFI);
  pin_status_led  = preferences.getInt("pSLed", STATUS_LED);
  pin_transistor  = preferences.getInt("pTrn", TRANSISTOR_PIN);
  pin_relay_ctrl  = preferences.getInt("pRly", RELAY_CONTROL);
  pin_buzzer      = preferences.getInt("pBuz", BUZZER);
  pin_sda         = preferences.getInt("pSDA", SDA_PIN);
  pin_scl         = preferences.getInt("pSCL", SCL_PIN);

  pcf_active_low = preferences.getBool("pAL", false); // Default ke false

  String pcfHex   = preferences.getString("pcf", "0x20");
  num_pcf_modules = 0;

  // Simple parser for "0x20,0x21"
  int lastComma = -1;
  for (int i = 0; i <= pcfHex.length(); i++) {
    if (i == pcfHex.length() || pcfHex[i] == ',') {
      String hexPart = pcfHex.substring(lastComma + 1, i);
      hexPart.trim();
      if (hexPart.length() > 0) {
        pcfAddresses[num_pcf_modules++] =
            (uint8_t)strtol(hexPart.c_str(), NULL, 0);
      }
      lastComma = i;
    }
  }
  num_relays = num_pcf_modules * 16;

  preferences.end();
  Serial.println("[CONFIG] Settings hydrated from memory.");
}

void saveSettings(String s, String p, String m, int pt, String ph,
                  int pm, int pl, int psl, int pr, int prly,
                  int pb, bool al) {
  preferences.begin("voc-config", false);
  preferences.putString("ssid", s);
  preferences.putString("pass", p);
  preferences.putString("mqtt", m);
  preferences.putInt("port", pt);
  preferences.putString("pcf", ph);
  preferences.putInt("pMod",  pm);
  preferences.putInt("pLed",  pl);
  preferences.putInt("pSLed", psl);
  preferences.putInt("pTrn",  pr);
  preferences.putInt("pRly",  prly);
  preferences.putInt("pBuz",  pb);
  preferences.putBool("pAL",  al);
  preferences.end();
  Serial.println("[CONFIG] New settings saved.");
}

// ─────────────────────────────────────────────────────────────
// BUZZER (Non-blocking)
// ─────────────────────────────────────────────────────────────

void startBuzzer(unsigned long durationMs) {
  buzzerBeepsRemaining = 1;
  buzzerState          = true;
  digitalWrite(pin_buzzer, HIGH);
  buzzerNextToggle = millis() + durationMs;
}

void startDoubleBuzzer() {
  buzzerBeepsRemaining = 3;
  buzzerState          = true;
  buzzerToneDuration   = 120;
  buzzerPauseDuration  = 80;
  digitalWrite(pin_buzzer, HIGH);
  buzzerNextToggle = millis() + buzzerToneDuration;
}

void updateBuzzer() {
  if (buzzerBeepsRemaining > 0 && millis() >= buzzerNextToggle) {
    buzzerBeepsRemaining--;
    if (buzzerBeepsRemaining == 0) {
      digitalWrite(pin_buzzer, LOW);
      buzzerState = false;
    } else {
      buzzerState = !buzzerState;
      digitalWrite(pin_buzzer, buzzerState ? HIGH : LOW);
      buzzerNextToggle =
          millis() + (buzzerState ? buzzerToneDuration : buzzerPauseDuration);
    }
  }
}

// ─────────────────────────────────────────────────────────────
// PCF8575 WRITE HELPER
// ─────────────────────────────────────────────────────────────

bool pcfWrite(uint8_t pin, bool state) {
  if (pin >= num_relays)
    return false;
  int pcfIndex = pin / 16;
  int pcfPin   = pin % 16;

  Wire.beginTransmission(pcfAddresses[pcfIndex]);
  if (Wire.endTransmission() != 0) {
    Serial.printf("[I2C] Error: Modul %d offline, re-init...\n", pcfIndex);
    pcfModules[pcfIndex]->begin();
  }
  bool pinLevel = pcf_active_low ? !state : state;
  pcfModules[pcfIndex]->write(pcfPin, pinLevel ? HIGH : LOW);
  return true;
}

// ─────────────────────────────────────────────────────────────
// WEB PORTAL (Premium Glassmorphism UI)
// ─────────────────────────────────────────────────────────────

String getHeader() {
  return "<!DOCTYPE html><html><head><meta charset='UTF-8'><meta "
         "name='viewport' content='width=device-width, initial-scale=1.0'>"
         "<link "
         "href='https://fonts.googleapis.com/"
         "css2?family=Outfit:wght@300;400;600;800&display=swap' "
         "rel='stylesheet'>"
         "<style>:root{--p:#3b82f6;--s:#10b981;--bg:#020617;--glass:rgba(255,"
         "255,255,0.03);} "
         "body{font-family:'Outfit',sans-serif;margin:0;padding:20px;"
         "background:radial-gradient(circle at 0% 0%, #1e1b4b 0%, #020617 "
         "100%);color:#f8fafc;min-height:100vh;} "
         "*{box-sizing:border-box;transition:0.3s cubic-bezier(0.4,0,0.2,1);} "
         ".card{background:rgba(15,23,42,0.6);backdrop-filter:blur(20px);-"
         "webkit-backdrop-filter:blur(20px);border-radius:32px;padding:30px;"
         "border:1px solid rgba(255,255,255,0.08);box-shadow:0 25px 50px -12px "
         "rgba(0,0,0,0.5);max-width:480px;margin:auto;} "
         "h1{font-weight:800;font-size:24px;margin-bottom:20px;display:flex;"
         "align-items:center;gap:12px;color:var(--p);} "
         ".field{margin-bottom:20px;} "
         "label{display:block;font-size:11px;font-weight:600;color:#64748b;"
         "text-transform:uppercase;letter-spacing:1px;margin-bottom:8px;} "
         "input,select{width:100%;background:rgba(255,255,255,0.03);border:1px "
         "solid "
         "rgba(255,255,255,0.1);border-radius:12px;padding:12px;color:white;"
         "outline:none;} "
         "input:focus{border-color:var(--p);background:rgba(59,130,246,0.05);} "
         ".row{display:flex;gap:10px;} "
         "button{background:linear-gradient(135deg,var(--p),#2563eb);color:"
         "white;border:none;padding:15px;border-radius:14px;font-weight:700;"
         "cursor:pointer;width:100%;} "
         ".scan-btn{width:auto;padding:8px "
         "15px;background:rgba(59,130,246,0.1);color:var(--p);border:1px solid "
         "var(--p);font-size:10px;} "
         ".pass-grp{position:relative;} "
         ".eye{position:absolute;right:12px;top:10px;cursor:pointer;opacity:0."
         "5;} "
         "#scan-res{margin-top:10px;background:rgba(0,0,0,0.3);border-radius:"
         "10px;overflow:hidden;max-height:0;transition:max-height 0.4s ease;} "
         ".scan-item{padding:10px;font-size:13px;border-bottom:1px solid "
         "rgba(255,255,255,0.05);cursor:pointer;} "
         ".scan-item:hover{background:rgba(59,130,246,0.1);} "
         ".badge{font-size:10px;background:rgba(16,185,129,0.15);color:#10b981;"
         "border:1px solid rgba(16,185,129,0.3);border-radius:6px;padding:2px 8px;}"
         "</style><script>"
         "function togglePass(){var "
         "x=document.getElementById('p');x.type=x.type==='password'?'text':'"
         "password';} "
         "function scan(){var "
         "r=document.getElementById('scan-res');r.style.maxHeight='200px';r."
         "innerHTML='<p "
         "style=\"padding:10px;font-size:11px;\">Scanning...</p>';"
         "fetch('/scan').then(res=>res.text()).then(h=>{r.innerHTML=h;});} "
         "function setSsid(s){document.getElementById('s').value=s;}"
         "</script></head><body>";
}

void handleRoot() {
  preferences.begin("voc-config", true);
  String h = getHeader();
  h += "<div class='card'><h1>⚙️ VOC CONFIG <span class='badge'>S3-UNO</span></h1>";
  h += "<form action='/save' method='POST'>";
  h += "<div class='field'><label>WIFI SSID <button type='button' "
       "class='scan-btn' onclick='scan()'>SCAN</button></label><input id='s' "
       "name='s' value='" +
       String(ssid) + "'> <div id='scan-res'></div></div>";
  h += "<div class='field'><label>WIFI PASSWORD</label><div "
       "class='pass-grp'><input id='p' name='p' type='password' value='" +
       String(password) +
       "'><span class='eye' onclick='togglePass()'>👀</span></div></div>";
  h += "<div class='field'><label>MQTT BROKER IP</label><input name='m' "
       "value='" +
       String(mqtt_server) + "'></div>";
  h += "<div class='field'><label>MQTT PORT</label><input name='pt' "
       "type='number' value='" +
       String(mqtt_port) + "'></div>";
  h += "<div class='field'><label>PCF ADDRESSES (CSV)</label><input name='ph' "
       "value='" +
       preferences.getString("pcf", "0x20") +
       "' placeholder='0x20,0x21'></div>";
  h += "<div class='row'>";
  h += " <div class='field'><label>PIN MODE</label><input name='pm' "
       "type='number' value='" +
       String(pin_mode_switch) + "'></div>";
  h += " <div class='field'><label>PIN WIFI LED</label><input name='pl' "
       "type='number' value='" +
       String(pin_led_wifi) + "'></div>";
  h += "</div><div class='row'>";
  h += " <div class='field'><label>PIN STATUS LED</label><input name='psl' "
       "type='number' value='" +
       String(pin_status_led) + "'></div>";
  h += " <div class='field'><label>PIN TRANSISTOR</label><input name='ptr' "
       "type='number' value='" +
       String(pin_transistor) + "'></div>";
  h += "</div><div class='row'>";
  h += " <div class='field'><label>PIN RELAY CTRL</label><input name='prly' "
       "type='number' value='" +
       String(pin_relay_ctrl) + "'></div>";
  h += " <div class='field'><label>PIN BUZZER</label><input name='pb' "
       "type='number' value='" +
       String(pin_buzzer) + "'></div>";
  h += "</div>";
  h += "<div class='field'><label>RELAY ACTIVE LOW</label><select "
       "name='al'><option value='1' " +
       String(pcf_active_low ? "selected" : "") +
       ">LOW (Common)</option><option value='0' " +
       String(!pcf_active_low ? "selected" : "") +
       ">HIGH</option></select></div>";
  h += "<button type='submit'>APPLY SETTINGS</button></form></div></body></html>";
  preferences.end();
  server.send(200, "text/html", h);
}

