Tirta7/voc_master_data_center/esp32s3uni_mqtt_client/esp32s3uni_mqtt_client.ino
void handleScan() {
  int    n = WiFi.scanNetworks();
  String h = "";
  for (int i = 0; i < n; i++) {
    h += "<div class='scan-item' onclick='setSsid(\"" + WiFi.SSID(i) + "\")'>" +
         WiFi.SSID(i) + " (" + String(WiFi.RSSI(i)) + "dBm)</div>";
  }
  server.send(200, "text/html", h);
}

void handleSave() {
  saveSettings(server.arg("s"), server.arg("p"), server.arg("m"),
               server.arg("pt").toInt(), server.arg("ph"),
               server.arg("pm").toInt(),  server.arg("pl").toInt(),
               server.arg("psl").toInt(), server.arg("ptr").toInt(),
               server.arg("prly").toInt(), server.arg("pb").toInt(),
               server.arg("al") == "1");
  server.send(200, "text/plain", "Settings saved. Rebooting...");
  delay(2000);
  ESP.restart();
}

void startPortal() {
  isConfigMode = true;
  WiFi.mode(WIFI_AP);
  WiFi.softAP("VOC-Billiard-S3UNO");
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  server.on("/", handleRoot);
  server.on("/scan", handleScan);
  server.on("/save", HTTP_POST, handleSave);
  server.onNotFound([]() {
    server.sendHeader("Location", "/", true);
    server.send(302, "text/plain", "");
  });
  server.begin();
  Serial.println("[PORTAL] AP Active: VOC-Billiard-S3UNO");
}

// ─────────────────────────────────────────────────────────────
// SPIFFS — Simpan & Muat Status Relay
// ─────────────────────────────────────────────────────────────
void saveToSPIFFS() {
  DynamicJsonDocument doc(4096);
  JsonArray           arr = doc.createNestedArray("state");
  for (int i = 0; i < num_relays; i++)
    arr.add(relayState[i]);

  JsonArray tmr = doc.createNestedArray("timers");
  for (int i = 0; i < num_relays; i++)
    tmr.add(tableTimer[i]);

  JsonArray alrt = doc.createNestedArray("alerts");
  for (int i = 0; i < num_relays; i++)
    alrt.add(tableAlertTime[i]);

  File f = SPIFFS.open("/relay_config.json", FILE_WRITE);
  if (f) {
    serializeJson(doc, f);
    f.close();
    Serial.println("[SPIFFS] State & Timers tersimpan.");
  }
}

void loadFromSPIFFS() {
  if (SPIFFS.exists("/relay_config.json")) {
    File f = SPIFFS.open("/relay_config.json", FILE_READ);
    if (f) {
      DynamicJsonDocument doc(4096);
      if (!deserializeJson(doc, f)) {
        for (int i = 0; i < num_relays; i++) {
          relayState[i]  = doc["state"][i] | false;
          tableTimer[i]  = doc["timers"][i] | 0;
          tableAlertTime[i] = doc["alerts"][i] | 300; // Default 5 menit
        }
        Serial.println("[SPIFFS] State & Timers di-restore.");
      }
      f.close();
    }
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT — Publish Status Telemetry
// ─────────────────────────────────────────────────────────────

void publishStatus() {
  if (!client.connected())
    return;

  String             topic = baseTopic + "/status";
  DynamicJsonDocument resp(4096);

  resp["status"]   = "ONLINE";
  resp["online"]   = true;
  resp["uptime"]   = millis() / 1000;
  resp["rssi"]     = WiFi.RSSI();
  resp["freeHeap"] = ESP.getFreeHeap();
  resp["ip"]       = WiFi.localIP().toString();
  resp["mac"]      = deviceMac;
  resp["hwType"]   = "PCF8575";
  resp["board"]    = "ESP32-S3-UNO";
  resp["mode"]     = modeOtomatis ? "AUTO" : "MANUAL";
  resp["modePin"]  = digitalRead(pin_mode_switch) == HIGH ? "OPEN" : "CLOSED";
  resp["relayCtrl"]= digitalRead(pin_relay_ctrl) == HIGH ? "ON" : "OFF";

  JsonArray relays = resp.createNestedArray("relays");
  for (int i = 0; i < num_relays; i++) {
    relays.add(relayState[i]);
  }

  JsonArray timers = resp.createNestedArray("timers");
  for (int i = 0; i < num_relays; i++) {
    timers.add(tableTimer[i] / 60); // Laporkan menit sisa ke dashboard
  }

  String buf;
  serializeJson(resp, buf);
  client.publish(topic.c_str(), buf.c_str(), true); // retain=true

  Serial.printf("[MQTT] ↑ Status published: %d relays, RSSI=%d\n", num_relays,
                WiFi.RSSI());
}

// ─────────────────────────────────────────────────────────────
// WIFI EVENT HANDLER
// ─────────────────────────────────────────────────────────────

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Terhubung! IP: %s\n",
                  WiFi.localIP().toString().c_str());
    digitalWrite(pin_led_wifi, HIGH);
    digitalWrite(pin_status_led, HIGH);
    wasWifiConnected = true;
    lastMqttRetry    = 0; // Langsung coba MQTT setelah WiFi connected
    break;
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] PUTUS dari AP! WiFi auto-reconnect...");
    digitalWrite(pin_led_wifi, LOW);
    digitalWrite(pin_status_led, LOW);
    wasWifiConnected = false;
    break;
  default:
    break;
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT CALLBACK — Terima Perintah dari Server
// ─────────────────────────────────────────────────────────────

void callback(char *topic, byte *payload, unsigned int length) {
  esp_task_wdt_reset();
  Serial.printf("[MQTT] Pesan masuk: %s (len=%u)\n", topic, length);

  DynamicJsonDocument  doc(4096);
  DeserializationError error = deserializeJson(doc, payload, length);
  if (error) {
    Serial.printf("[MQTT] JSON parse error: %s\n", error.c_str());
    return;
  }

  String sTopic = String(topic);

  // ── 1. PING ──────────────────────────────────────────────────
  if (sTopic.endsWith("/ping")) {
    int                 tableId = doc["tableId"] | 0;
    DynamicJsonDocument resp(256);
    resp["tableId"]  = tableId;
    resp["status"]   = "PONG";
    resp["uptime"]   = millis() / 1000;
    resp["rssi"]     = WiFi.RSSI();
    resp["hwType"]   = "PCF8575";
    resp["board"]    = "ESP32-S3-UNO";
    resp["mac"]      = deviceMac;

    char buffer[256];
    serializeJson(resp, buffer);
    client.publish((baseTopic + "/status").c_str(), buffer);
    Serial.println("[MQTT] PING → PONG terkirim.");
    return;
  }

  // ── 2. SYNC RESPONSE (Batched Payload) ───────────────────────
  if (sTopic.endsWith("/sync_response")) {
    Serial.println("[MQTT] Menerima Batched Sync Response dari Server!");
    JsonArray tables = doc["tables"].as<JsonArray>();

    unsigned long now       = millis();
    bool          anyChange = false;

    for (JsonObject t : tables) {
      int pinIndex = t["relayPin"] | -1;
      if (pinIndex == -1)
        pinIndex = (t["tableId"] | 1) - 1; // Fallback
      if (pinIndex < 0 || pinIndex >= num_relays)
        continue;

      const char *statusStr  = t["status"] | "OFF";
      bool        targetStatus = (strcasecmp(statusStr, "ON") == 0);

      if (relayState[pinIndex] != targetStatus ||
          relayTarget[pinIndex] != targetStatus) {
        relayTarget[pinIndex] = targetStatus;
        relayState[pinIndex]  = targetStatus;
        pcfWrite(pinIndex, targetStatus);
        anyChange = true;
      }
    }

