Tirta7/voc_master_data_center/esp32s3uni_mqtt_client/esp32s3uni_mqtt_client.ino
    if (anyChange) {
      storageDirty    = true;
      lastStateChange = now;
      startBuzzer(600);
      Serial.println("[MQTT] Sync State Terapan Sukses (Bulk).");
      publishStatus(); // 🚀 Kirim feedback instan setelah sync
    } else {
      Serial.println("[MQTT] Sync: State sudah sesuai, tidak ada perubahan.");
    }
    return;
  }

  // ── 3. LIGHT CONTROL ─────────────────────────────────────────
  if (sTopic.endsWith("/light/set")) {
    const char *status   = doc["status"] | "";
    bool        activate = (strcasecmp(status, "ON") == 0);
    bool        isExtend = doc["extend"] | false;
    bool        isForce  = doc["force"] | false;
    int         tableId  = doc["tableId"] | 0;

    int pinIndex = -1;
    if (doc.containsKey("relayPin") && !doc["relayPin"].isNull()) {
      pinIndex = doc["relayPin"].as<int>();
    } else {
      pinIndex = tableId - 1; // Fallback
    }

    if (pinIndex < 0 || pinIndex >= num_relays) {
      Serial.printf("[MQTT] GAGAL: PinIndex %d diluar jangkauan (0-%d)\n",
                    pinIndex, num_relays - 1);
      return;
    }

    if (!modeOtomatis) {
      Serial.println("[MQTT] PERINGATAN: Berjalan dalam MODE MANUAL. Perintah "
                     "diizinkan (Debug Mode).");
    }

    unsigned long now = millis();

    if (!activate) {
      if (relayProtectedUntil[pinIndex] > now && !isForce) {
        Serial.printf("[PROTECT] Blocked Pin %d (Race Condition, sisa %lu s)\n",
                      pinIndex, (relayProtectedUntil[pinIndex] - now) / 1000);
        return;
      }
      relayState[pinIndex]  = false;
      relayTarget[pinIndex] = false;
      tableTimer[pinIndex]  = 0; // 🛡️ Reset Timer
      pcfWrite(pinIndex, false);
      // Update RELAY_CONTROL jika ini pin pertama
      if (pinIndex == 0)
        digitalWrite(pin_relay_ctrl, LOW);
      storageDirty    = true;
      lastStateChange = now;
      startBuzzer(200);
      Serial.printf("[RELAY] DB_ID:%d MAC:%s Pin%d → OFF\n", tableId,
                    deviceMac.c_str(), pinIndex);
    } else {
      // 🛡️ Proteksi minimalis 500ms (nyaris instan tapi tetap aman untuk relay)
      unsigned long protDuration        = isExtend ? 60000 : 500;
      relayProtectedUntil[pinIndex]     = now + protDuration;

      // 🛡️ Play Time (Open) Fix: 0 = Infinite, >0 = Countdown
      uint32_t duration        = doc["duration"] | 0;
      tableTimer[pinIndex]     = (uint32_t)duration * 60;

      // 🛡️ Parse alertMinute dari payload (default 5 menit jika tidak dikirim)
      uint32_t alertMin = doc["alertMinute"] | 5;
      tableAlertTime[pinIndex] = alertMin * 60;

      relayState[pinIndex]  = true;
      relayTarget[pinIndex] = true;
      pcfWrite(pinIndex, true);
      // Update RELAY_CONTROL jika ini pin pertama
      if (pinIndex == 0)
        digitalWrite(pin_relay_ctrl, HIGH);
      storageDirty    = true;
      lastStateChange = now;
      if (isExtend)
        startDoubleBuzzer();
      else
        startBuzzer(500);
      Serial.printf("[RELAY] DB_ID:%d MAC:%s Pin%d → ON (%s) | Timer: %u min\n",
                    tableId, deviceMac.c_str(), pinIndex,
                    isExtend ? "EXTEND" : "START", duration);
    }
    publishStatus(); // 🚀 Kirim feedback instan setelah perintah diterima
    return;
  }

  // ── 4. RELAY CONTROL (Direct GPIO 15) ────────────────────────
  if (sTopic.endsWith("/relay/set")) {
    const char *st    = doc["status"] | "OFF";
    bool        state = (strcasecmp(st, "ON") == 0);
    digitalWrite(pin_relay_ctrl, state ? HIGH : LOW);
    Serial.printf("[RELAY_CTRL] GPIO%d → %s\n", pin_relay_ctrl, st);
    startBuzzer(100);
    return;
  }

  // ── 5. GPIO DIAGNOSTIC (Test Mode) ───────────────────────────
  if (sTopic.endsWith("/gpio/set")) {
    int         pin   = doc["pin"] | -1;
    const char *st    = doc["status"] | "OFF";
    bool        state = (strcasecmp(st, "ON") == 0);

    if (pin >= 100) {
      // Direct PCF8575 Control: 100-115 = Modul 0, 116-131 = Modul 1, etc.
      int pcfPinIndex = pin - 100;
      pcfWrite(pcfPinIndex, state);
      Serial.printf("[DIAG] PCF8575 Pin%d → %s\n", pcfPinIndex, st);
      startBuzzer(100);
    } else if (pin != -1) {
      pinMode(pin, OUTPUT);
      digitalWrite(pin, state ? HIGH : LOW);
      Serial.printf("[DIAG] GPIO%d → %s\n", pin, st);
      startBuzzer(100);
    }
    return;
  }

  // ── 6. SYSTEM COMMAND ─────────────────────────────────────────
  if (sTopic.endsWith("/system/set")) {
    const char *cmd = doc["command"] | "";
    if (strcmp(cmd, "REBOOT") == 0) {
      Serial.println("[SYSTEM] Reboot via MQTT...");
      startBuzzer(1000);
      delay(1500);
      ESP.restart();
    }
    return;
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT — Reconnect Handler
// ─────────────────────────────────────────────────────────────

void handleMqttConnection() {
  if (client.connected())
    return;
  if (millis() - lastMqttRetry < 8000)
    return;
  lastMqttRetry = millis();

  String clientId = "SpotOn-S3UNO-" + deviceMac;
  String lwtTopic = baseTopic + "/status";

  Serial.printf("[MQTT] Menghubungi Broker di %s:%d...\n", mqtt_server,
                mqtt_port);
  Serial.printf("[MQTT] ClientID: %s\n", clientId.c_str());

  if (client.connect(clientId.c_str(), lwtTopic.c_str(), 1, true,
                     "{\"status\":\"offline\",\"hwType\":\"PCF8575\","
                     "\"board\":\"ESP32-S3-UNO\"}")) {

    // Kirim status awal instan agar Jendral langsung mendapatkan MAC Address
    publishStatus();

    client.subscribe((baseTopic + "/#").c_str());

    // Minta sync state dari server
    client.publish("billiard/table/sync", deviceMac.c_str());

    Serial.println("[MQTT] Terhubung & Sync Request dikirim!");
    Serial.printf("[MQTT] Subscribed ke: %s/#\n", baseTopic.c_str());
  } else {
    int state = client.state();
    Serial.printf("[MQTT] GAGAL (rc=%d). Retry 8s lagi.\n", state);
    if (state == -2) {
      Serial.println(
          ">>RC -2: Cek IP server, port 1883, dan Mosquitto berjalan.");
    }
  }
}

