Tirta7/voc_master_data_center/esp32s3uni_mqtt_client/esp32s3uni_mqtt_client.ino
// ─────────────────────────────────────────────────────────────
// SETUP
// ─────────────────────────────────────────────────────────────

void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println("\n\n=== BOOTING ESP32-S3 UNO — VOC SYSTEM ===");
  Serial.println("    Board  : ESP32-S3 UNO");
  Serial.println("    Firmware: v18.6 PREMIUM PORTAL (S3-UNO Version)");

  // 🛡️ 1. LOAD CONFIGURATION
  loadSettings();

  // 🛡️ 2. EMERGENCY PORTAL TRIGGER (Hold Mode Switch at boot)
  pinMode(pin_mode_switch, INPUT_PULLUP);
  pinMode(0, INPUT_PULLUP); // 🛡️ Inisialisasi Tombol BOOT (GPIO 0)
  if (digitalRead(pin_mode_switch) == LOW || strlen(ssid) == 0) {
    Serial.println("[SYSTEM] Trigger Portal detected...");
    startPortal();
  }

  // 🛡️ 3. GPIO INIT (ESP32-S3 UNO Pin Map)
  pinMode(pin_led_wifi,   OUTPUT);
  pinMode(pin_status_led, OUTPUT);
  pinMode(pin_buzzer,     OUTPUT);
  pinMode(pin_transistor, OUTPUT);
  pinMode(pin_relay_ctrl, OUTPUT);
  digitalWrite(pin_led_wifi,   LOW);
  digitalWrite(pin_status_led, LOW);
  digitalWrite(pin_buzzer,     LOW);
  digitalWrite(pin_transistor, LOW);
  digitalWrite(pin_relay_ctrl, LOW);

  Serial.printf("[GPIO] MODE_SWITCH    : GPIO %d\n", pin_mode_switch);
  Serial.printf("[GPIO] LED_WIFI       : GPIO %d\n", pin_led_wifi);
  Serial.printf("[GPIO] STATUS_LED     : GPIO %d\n", pin_status_led);
  Serial.printf("[GPIO] TRANSISTOR_PIN : GPIO %d\n", pin_transistor);
  Serial.printf("[GPIO] RELAY_CONTROL  : GPIO %d\n", pin_relay_ctrl);
  Serial.printf("[GPIO] BUZZER         : GPIO %d\n", pin_buzzer);
  Serial.printf("[GPIO] SDA_PIN        : GPIO %d\n", pin_sda);
  Serial.printf("[GPIO] SCL_PIN        : GPIO %d\n", pin_scl);

  // 🛡️ 4. I2C INIT (SDA=9, SCL=8 untuk ESP32-S3 UNO)
  Wire.begin(pin_sda, pin_scl);
  Wire.setClock(400000); // 🚀 I2C Fast Mode untuk respon instan
  Serial.printf("[I2C] Bus init: SDA=GPIO%d, SCL=GPIO%d @ 400kHz\n",
                pin_sda, pin_scl);

  // 5. Mount SPIFFS & restore state
  if (SPIFFS.begin(true)) {
    loadFromSPIFFS();
  }

  // 6. Dynamic PCF Init & restore relay states
  Serial.printf("[HARDWARE] Initializing %d PCF8575 module(s)...\n",
                num_pcf_modules);
  for (int i = 0; i < num_pcf_modules; i++) {
    pcfModules[i] = new PCF8575(pcfAddresses[i]);
    
    // Pre-emptively set the correct state directly via I2C before the library does anything
    // This prevents any "flash" or all lamps turning on due to library default behaviors.
    uint16_t initialState = 0;
    for (int p = 0; p < 16; p++) {
      int globalIdx = (i * 16) + p;
      bool s = relayState[globalIdx];
      bool pinLevel = pcf_active_low ? !s : s;
      if (pinLevel) initialState |= (1 << p);
    }
    Wire.beginTransmission(pcfAddresses[i]);
    Wire.write(initialState & 0xFF);
    Wire.write(initialState >> 8);
    Wire.endTransmission();

    pcfModules[i]->begin();
    for (int p = 0; p < 16; p++) {
      int  globalIdx = (i * 16) + p;
      bool s         = relayState[globalIdx];
      bool pinLevel  = pcf_active_low ? !s : s;
      pcfModules[i]->write(p, pinLevel ? HIGH : LOW);
      relayTarget[globalIdx] = s;
    }
    Serial.printf("[PCF] Modul %d (0x%02X) → %d relay dipulihkan.\n",
                  i, pcfAddresses[i], 16);
  }

  // 🛡️ 7. MODE & MASTER RELAY
  modeOtomatis = (digitalRead(pin_mode_switch) == HIGH);
  if (modeOtomatis) {
    digitalWrite(pin_transistor, HIGH);
    Serial.println("[HARDWARE] Auto Mode: Master Relay Active (TRANSISTOR_PIN HIGH).");
  }

  // 8. Watchdog 30 detik
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  esp_task_wdt_config_t wdt_config = {
      .timeout_ms = 30000, .idle_core_mask = 0, .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdt_config);
#else
  esp_task_wdt_init(30, true);
#endif
  esp_task_wdt_add(NULL);

  // 9. Baca MAC Address
  uint8_t baseMac[6];
  esp_efuse_mac_get_default(baseMac);
  char macStr[13];
  sprintf(macStr, "%02X%02X%02X%02X%02X%02X", baseMac[0], baseMac[1],
          baseMac[2], baseMac[3], baseMac[4], baseMac[5]);
  deviceMac = String(macStr);
  baseTopic  = "billiard/table/" + deviceMac;

  Serial.printf("[DEVICE] MAC Address : %s\n", deviceMac.c_str());
  Serial.printf("[DEVICE] Base Topic  : %s\n", baseTopic.c_str());
  Serial.printf("[DEVICE] Mode        : %s\n",
                modeOtomatis ? "OTOMATIS" : "MANUAL");

  // 🛡️ 10. NETWORK & MQTT (Only if not in Portal Mode)
  if (!isConfigMode) {
    client.setKeepAlive(120);
    client.setSocketTimeout(15);  // Increased for stability
    client.setBufferSize(4096);   // 🚀 Increased for multi-table batch status
    client.setServer(mqtt_server, mqtt_port);
    client.setCallback(callback);

    WiFi.onEvent(onWifiEvent);
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.persistent(true);
    WiFi.setSleep(false); // 🚀 Matikan WiFi Sleep agar respon MQTT instan

    Serial.printf("[WiFi] STA Mode: Connecting to '%s'...\n", ssid);
    WiFi.begin(ssid, password);

    int retry = 0;
    while (WiFi.status() != WL_CONNECTED && retry < 20) {
      delay(500);
      Serial.print(".");
      retry++;
    }
    Serial.println();

    if (WiFi.status() == WL_CONNECTED) {
      Serial.printf("[WiFi] Connected! IP: %s\n",
                    WiFi.localIP().toString().c_str());
      digitalWrite(pin_status_led, HIGH); // STATUS LED ON saat WiFi OK
      startDoubleBuzzer();
    } else {
      Serial.println("[WiFi] Connection failed. Will retry in loop().");
    }
  }

  Serial.println("\n=== ESP32-S3 UNO PANEL NODE READY ===");
  Serial.printf("Daftarkan panel ini di Admin → Manajemen Meja\n");
  Serial.printf("  Board       : ESP32-S3 UNO\n");
  Serial.printf("  MAC Address : %s\n", deviceMac.c_str());
  Serial.printf("  Relay Count : %d channel\n", num_relays);
  Serial.printf("  I2C Bus     : SDA=GPIO%d, SCL=GPIO%d\n", pin_sda, pin_scl);
  if (isConfigMode)
    Serial.println("  STATUS      : 🛠️ CONFIG MODE (PORTAL ACTIVE)");
  Serial.println("=====================================\n");
}

