Tirta7/voc_master_data_center/esp32s3uni_mqtt_client/esp32s3uni_mqtt_client.ino
// ─────────────────────────────────────────────────────────────
// LOOP
// ─────────────────────────────────────────────────────────────

void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();
  updateBuzzer();

  // 🛡️ 0. MANUAL PORTAL TRIGGER (Hold BOOT Button 5s)
  if (digitalRead(0) == LOW && !isConfigMode) {
    if (portalTriggerStart == 0)
      portalTriggerStart = now;
    if (now - portalTriggerStart > 5000) {
      Serial.println("[SYSTEM] BOOT Button held 5s, starting portal...");
      startDoubleBuzzer();
      startPortal();
    }
  } else {
    portalTriggerStart = 0;
  }

  // 🛡️ 1. CONFIG MODE (Portal)
  if (isConfigMode) {
    dnsServer.processNextRequest();
    server.handleClient();
    // Blink LED_WIFI & STATUS_LED saat config mode
    bool blink = (now / 500) % 2;
    digitalWrite(pin_led_wifi,   blink);
    digitalWrite(pin_status_led, !blink); // Status LED counter-blink
    return;
  }

  // 🛡️ 2. MODE SWITCH DETECTION
  bool currentMode = (digitalRead(pin_mode_switch) == HIGH);
  if (currentMode != modeOtomatis) {
    modeOtomatis = currentMode;
    digitalWrite(pin_transistor, modeOtomatis ? HIGH : LOW);
    for (int i = 0; i < num_relays; i++) {
      bool s = modeOtomatis && relayState[i];
      pcfWrite(i, s);
      relayTarget[i] = s;
    }
    startBuzzer(500);
    publishStatus();
    Serial.printf("[MODE] Switch → %s\n", modeOtomatis ? "OTOMATIS" : "MANUAL");
  }

  // 🛡️ 3. NETWORK HANDLING
  if (WiFi.status() == WL_CONNECTED) {
    handleMqttConnection();
    client.loop();

    // 🚀 LED INDICATOR:
    // LED_WIFI Solid ON + STATUS_LED ON   = All Systems OK (WiFi + MQTT)
    // LED_WIFI Fast Blink + STATUS_LED ON = WiFi OK but MQTT Failed
    // LED_WIFI Slow Blink + STATUS_LED OFF = WiFi Connecting...
    if (client.connected()) {
      digitalWrite(pin_led_wifi,   HIGH);
      digitalWrite(pin_status_led, HIGH);
    } else {
      digitalWrite(pin_led_wifi,   (now / 100) % 2);
      digitalWrite(pin_status_led, HIGH); // WiFi OK, MQTT belum
    }

    if (now - lastStatusUpdate > STATUS_INTERVAL) {
      lastStatusUpdate = now;
      publishStatus();
    }

    if (now - lastHeartbeat > HEARTBEAT_INTERVAL) {
      lastHeartbeat = now;
      publishHeartbeat();
    }

  } else {
    digitalWrite(pin_led_wifi,   (now / 500) % 2 == 0 ? HIGH : LOW);
    digitalWrite(pin_status_led, LOW); // Status LED OFF saat WiFi disconnect
    if (now - lastWifiCheck > WIFI_FULL_RECONNECT) {
      lastWifiCheck = now;
      WiFi.disconnect();
      WiFi.begin(ssid, password);
    }
  }

  // 🛡️ 4. DEFERRED STORAGE SAVE
  if (storageDirty && (now - lastStateChange > STORAGE_SAVE_DELAY)) {
    saveToSPIFFS();
    storageDirty = false;
  }

  // 🛡️ 5. AUTONOMOUS TIMERS
  if (now - lastTimerTick >= 1000) {
    lastTimerTick = now;
    bool anyStop  = false;
    for (int i = 0; i < num_relays; i++) {
      if (relayState[i] && tableTimer[i] > 0) {
        tableTimer[i]--;
        
        // 🚀 Trigger blink 2x jika waktu tersisa persis sama dengan alert time
        if (tableAlertTime[i] > 0 && tableTimer[i] == tableAlertTime[i]) {
          relayBlinkCount[i] = 4; // 4 transisi (OFF -> ON -> OFF -> ON)
          relayBlinkTimer[i] = now;
          pcfWrite(i, false); // Matikan seketika untuk memulai kedipan
        }

        if (tableTimer[i] == 0) {
          pcfWrite(i, false);
          relayState[i]  = false;
          relayTarget[i] = false;
          anyStop        = true;
          startBuzzer(1000);
          Serial.printf("[TIMER] Pin%d → Timer habis, relay OFF.\n", i);
        }
      }
    }
    if (anyStop)
      publishStatus();
  }

  // 🛡️ 5.1 NON-BLOCKING RELAY BLINKER
  for (int i = 0; i < num_relays; i++) {
    if (relayBlinkCount[i] > 0) {
      if (now - relayBlinkTimer[i] >= 800) { // Durasi tiap kedipan: 800ms
        relayBlinkTimer[i] = now;
        relayBlinkCount[i]--;
        
        if (relayBlinkCount[i] > 0) {
          bool isOff = (relayBlinkCount[i] % 2 == 0); 
          pcfWrite(i, !isOff); 
        } else {
          // Kedipan selesai, kembalikan ke state aslinya (ON)
          pcfWrite(i, relayTarget[i]);
        }
      }
    }
  }

  // 🛡️ 6. GHOST FIX (Every 10s — Verifikasi state PCF8575)
  if (modeOtomatis && (now - lastPcfVerify > 10000)) {
    lastPcfVerify = now;
    for (int i = 0; i < num_relays; i++) {
      int pcfIndex = i / 16;
      int pcfPin   = i % 16;
      if (pcfModules[pcfIndex]->read(pcfPin) !=
          (pcf_active_low ? !relayTarget[i] : relayTarget[i])) {
        pcfWrite(i, relayTarget[i]);
      }
    }
  }
}

// ─────────────────────────────────────────────────────────────
// HEARTBEAT PUBLISHER
// ─────────────────────────────────────────────────────────────

void publishHeartbeat() {
  String htopic   = baseTopic + "/heartbeat";
  String hpayload = "{\"uptime\":"   + String(millis() / 1000) +
                    ",\"rssi\":"     + String(WiFi.RSSI()) +
                    ",\"hwType\":\"PCF8575\""
                    ",\"board\":\"ESP32-S3-UNO\""
                    ",\"freeHeap\":" + String(ESP.getFreeHeap()) + "}";
  client.publish(htopic.c_str(), hpayload.c_str());
}
